---
kind: method
id: M:Autodesk.Revit.DB.PlanTopologySet.Contains(Autodesk.Revit.DB.PlanTopology)
source: html/c2782f2f-5670-449a-1f53-3e8039552ca7.htm
---
# Autodesk.Revit.DB.PlanTopologySet.Contains Method

Tests for the existence of an item within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	PlanTopology item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PlanTopology`) - The item to be searched for.

## Returns
The Contains method returns True if the item is within the set, otherwise False.